package com.vsu.c1.t7;

/**线程组：ThreadGroup
 * Created by vsu on 2018/01/31.
 */

/**
 * 可以把线程归属到某一个线程组中，线程组中可以有线程对象，也可以有线程组，组中还可以有线程。树
 * 线程组的作用：可以批量的管理线程或线程组对象，有效地对线程或线程组对象进行组织
 */


/**
 * 1
 * 线程对象关联线程组：1级关联
 * 1级关联：父对象中有子对象，但并不创建子孙对象
 * 例子：线程组--线程
 */


/**
 * 2
 * 多级关联：线程树结构
 */

/**
 * 3
 * 线程组自动归属特性：
 *      自动归属就是自动归到当前线程组中
 */

/**
 * 4
 * 获得根线程组：
 *      JVM的根线程组就是system，再取其父线程则出现空异常
 */

/**
 * 5
 * 递归与非递归取得组内对象
 */

/**
 * 6
 * 使线程具有有序性
 */
public class Test2 {
    public static void main(String[] args) {

    }
}
